app/Controllers/Clientes.php

SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '8'
---
	public function update($id)
	{
		$dataFind = $this->Model->find($id);
		if($dataFind == false){
			return redirect()->to(base_url('/Clientes'));
		}
		$data = [
			'AttributePage' => $this->PageData,
			'content' => 'Edite Pages',
			'action' => 'clientes/update_action',
			'data' => $this->Model->find($id),
        ];